{
  "image_name": "Vamp0000012452.png",
  "ocr_text": "JOHNSTONE SUPPLY\nRochester: 95 Halstead Street, 14610\nToll\nFree: (800) 724-8806\nTel: (585) 482-8000 • Fax: (585) 482-6000\neMail: store141@johnstonesupply.com\nSyracuse: 835 Canal Street, 13210\nToll Free: (877) 724-8806\nTel: (315) 479-8800 Fax: (315) 479-8600\neMail: store269@johnstonesupply.com\nOrder on-line at www.JohnstoneSupply.com/141\nJOB DESCRIPTION\nJob Title:\nFLSA Status:\nReports To:\nWarehouse Delivery Driver\nNon-Exempt/Full-Time\nBranch Manager\nPosition Summary:\nWorking at the direction of the Branch Manager, the warehouse delivery driver is responsible for\nproviding support to the warehousing operations with specific responsibilities of transporting\norders over designated routes; ensuring safe operation of vehicles; and loading and unloading\norders.\nSubordinate Summary:\nThis position has no formal supervisory responsibilities.\nEssential Job Results and Responsibilities:\nCore Duties and Responsibilities\n1. Assists in receiving stock and nonstock items for the purpose of ensuring specifications,\nquantity and quality of orders are correct.\n2. Cleans warehouse for the purpose of maintaining a safe and sanitary work area.\n3. Delivers a variety of materials primarily to customers for the purpose of distributing\ninventory from internal or external sources over scheduled and/or unscheduled routes to\nassigned locations and/or individuals.\n4. Drives vehicles (e.g. truck, van, forklift, etc.) for the purpose of transporting orders and\nmaterials to designated sites.\n5. Loads and unloads delivery trucks for the purpose of receiving stock and/or filling orders\nfor transport.\n6. Maintains delivery vehicles (e.g. checking fluid levels, fueling, cleaning, etc.) for the\npurpose of ensuring safe operation of vehicle.\n7. Maintains records (e.g. delivery log, etc.) for the purpose of documenting activities and\nproviding reliable resource information.\n8. Participates in physical inventories for the purpose of verifying stock and identifying\nlosses.\n9. Performs all functions within the scope of the warehouse for the purpose of providing\nwarehousing operations.\n10. Prepares orders by pulling from stock for the purpose of meeting delivery requirements.\nJohnstone Supply of Central NY provides equal employment opportunities to all employees and applicants for employment and\nprohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status,\ngenetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal,\nstate or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion,\ntermination, layoff, recall, transfers, leaves of absence, compensation and training.\nJohnstone Supply of Central NY-Confidential\n1 of 4\nRev 190905\nWarehouse Delivery Driver.docx",
  "confidence": 0.925
}