{
  "image_name": "Vamp0000016571.png",
  "ocr_text": "In consideration of each BANK's compliance with this authorization, CLIENT agrees that such BANK's treatment of any charge, and such BANK's rights with\nrespect thereto, shall be the same as if the charge were initiated personally by CLIENT, and that if any charge is dishonored, whether with or without cause,\nsuch BANK shall be under no liability whatsoever. In addition, CLIENT authorizes ADP to credit the applicable DDA ACCOUNT when necessary, at ADP's\nsole discretion, for any refund or credit amount due CLIENT.\nIn the event of any conflict between the terms and conditions of this Agreement and the terms and conditions of any other agreement, this Agreement shall\ncontrol with respect to any money transmission services, including Payment Services. CLIENT acknowledges and agrees that, notwithstanding anything to the\ncontrary, CLIENT'S right to refund under any State law shall first be subject to any offset for funds due to ADP with respect to any previous transactions\ncompleted on CLIENT'S behalf by ADP, and subject to the terms and conditions of this Agreement and any other agreement between CLIENT and ADP.\nThis authorization shall remain in effect unless and until revoked in writing by an authorized representative of CLIENT and until the applicable BANK(s) and\nADP have each received such notice and have had reasonable time to act upon such notice.\nCLIENT Signature\nKenneth Livingston\nKenneth Livingston\nCLIENT Representative Name & Title.\nDate 12/18/2019 12:46:53 PM\nPresident\n(Must be an authorized signatory on the accounts listed on page 1 on this Agreement)\nFOR REGION USE ONLY/ADP DO NOT DEBIT ACCOUNT\nCORPORATE CHECK (This bank account below will be printed on your company checks):\nBANK Transit/ABA #\nBANK Account(DDA)#\nBank Name\nStarting Check number\nBank Address\nComments\nBank Phone\nClient Phone\nRW-ACH-RWX CAA (11/18)\nPage 2 of 5\nADP eSignature Info:\nDate/Time:\n12/18/2019 12:46:53 PM\nIP:\nID:\n72.45.184.26\n1004159309\nRevised AVS-FCM-11/15/18",
  "confidence": 0.972
}