{
  "image_name": "Vamp0000057326.jpeg",
  "ocr_text": "Law\nFMLA Expansion\n(eff. April 1, 2020 to\nDecember 31, 2020)\nApplies to public and private\nWhat Triggers Benefits?\nEmployee unable to work (or telework) to care for a minor child if the\nchild's elementary or secondary school or place of child care has been\nclosed or is unavailable due to a public health emergency.\nWhat is the Benefit?\nFirst 10 days of this FMLA leave is unpaid, but an employee may elect\n(i.e., cannot be forced) to use his/her accrued paid leave, including\nFederal Emergency Paid Sick Leave (if applicable). Remaining leave is\nemployee would otherwise be scheduled to work. Capped at $200 per\nday and $10,000 total.\nAdditional Information\nJob restoration to the same or equivalent\nposition, but under certain circumstances\nemployers with fewer than 25 employees\nmay be exempt from this requirement.\nemployers with fewer than A \"public health emergency\" is limited to a COVID-19 emergency declared paid at 2/3 of the employee's regular rate, for the number of hours the Employers of health care providers and/or\n500 employees.\nby a Federal, State or local authority.\nApplies to any employee who A \"child care provider\" means a provider who receives compensation for\nhas employed for at least 30\nproviding child care services on a regular basis.\ncalendar days.\nemergency responders may exclude such\nemployees from this emergency FMLA leave\nentitlement.\nFederal Emergency Paid Sick\nLeave (eff. April 1, 2020 to\nDecember 31, 2020)\nApplies to public and private\nemployers with fewer than\n500 employees.\nApplies to all employees,\nregardless of length of\nemployment.\nEmployee is unable to work (or telework) because they are:\n1. subject to a federal, state or local quarantine or isolation order related\nto COVID-19;\n2. advised by a health care provider to self-quarantine due to concerns\nrelated to COVID-19;\n3. experiencing symptoms of COVID-19 and seeking medical diagnosis;\n4. caring for \"an individual\" subject to (1) or (2) above;\n5. caring for the employee's child if the child's school or place of care is\nclosed or unavailable due to COVID-19 precautions; or\n6. experiencing any other substantially similar condition specified by the\nSec. of Health & Human Services in consultation with the Sec. of the\nTreasury and the Sec. of Labor.\nFT employees receive 80 hours of paid sick leave.\nPT employees number of hours of paid sick leave that they work on\naverage over a two-week period.\nFull pay for reasons 1, 2 or 3.\nTwo-thirds pay for reasons 4, 5 or 6.\nCapped at $511 per day ($5,110 total) for reasons 1, 2, or 3. Capped\n$200 per day ($2,000 total) for reasons 4, 5 or 6.\nPaid sick time may not be carried over to the following year.\nEmployers must post a required notice\nconcerning this Emergency Paid Sick Leave.\nNotice will be available from the Sec. of\nLabor by March 25, 2020.\nEmployers cannot require employees to use\ntheir other accrued leave time before using\nthis emergency sick leave and cannot require\nat the employee to find a replacement worker.\nEmployers of health care providers and/or\nemergency responders may exclude such\nemployees from this Emergency Paid Sick\nLeave.\nThere will be a tax credit each calendar quarter for 100% of the qualified sick leave wages paid in that calendar quarter by an employer (capped at the same amounts as the benefit itself) for Federal Emergency FMLA leave\nand/or Emergency Paid Sick Leave, as well as tax credits for the cost of continuing health insurance for employees on leave. Consult a tax professional for more details.",
  "confidence": 0.978
}