{
  "image_name": "Vamp0000036923.png",
  "ocr_text": "Easton, PA, USA\n$ competitive wage based on experience along with a $1,000 sign on bonus plus\nmonthly and yearly bonuses\nFull Time\n■ comprehensive benefits including, medical, prescription, dental, and vision plans,\na 401(k) with company match, company-paid life insurance, paid holidays, and paid\ntime off (PTO)\nEmail Me Similar Jobs\nEmail Me This Job\nJohnstone Supply is scouting a full-time Delivery Services Team Member\n(Driver) join our Easton, PA team and deliver merchandise to customers in a safe\nand timely manner.\nWHY YOU SHOULD\nOur company cares about career development and believes in investing in our team.\nWe offer our Equipment Delivery Services Team Members (Driver) an experience-\nbased hourly pay, a $1,000 sign-on bonus, plus monthly and yearly bonuses\nand a Mon - Fri work schedule to includes some overtime during peak seasons. Our\nteam members also receive great benefits, including medical, prescription,\ndental, and vision plans, a 401(k) with company match, company-paid life\ninsurance, paid holidays, and paid time off (PTO). We also make it easy to apply\nwith our initial quick and easy mobile-optimized application. If we have your\nattention, please continue reading!\nABOUT JOHNSTONE SUPPLY\nJohnstone Supply is a one-stop-shop with a variety of options in unitary and specialty\nequipment, repair and replacement parts, and maintenance supplies for residential,\nlight commercial, refrigeration, and facilities maintenance. We offer the products,\nprograms, and services that help contractors of all sizes succeed. We're committed to\nbeing our customers' HVAC/R resource from start to finish.\nWith a friendly, fun, and team-oriented environment, our employees know that they\nare not just a number. We value their hard work and show it through our employee\nrecognition program, bonuses, competitive pay, and great benefits. We also\noffer training through Johnstone University both online and in the classroom.\nCome join our family!",
  "confidence": 0.983
}