{
  "image_name": "Vamp0000012453.png",
  "ocr_text": "Job Description- Warehouse Delivery Driver- continued\n11. Transports a variety of items for the purpose of receiving and/or delivering materials on\nboth scheduled and unscheduled pickup and delivery routes.\n12. Other duties as many be assigned.\nCustomer Service Results and Responsibilities\n1. Assist sales efforts on an as needed basis including but not limited to assisting in-store\ncustomers, filling customer orders, delivery to customers, and answering telephones.\n2. Answers incoming telephone calls and emails and greets customers who walk in the store.\nHandles multiple customers and customer requests simultaneously while maintaining a\nfriendly and professional manner.\n3. Follows up promptly on all customer requests for information, quotes, alternative parts and\ndelivery dates. Proactively communicates with customers about any expected delays or\nissues with their order.\n4. Develops good working relationships and rapport with customers. Greets regular\ncustomers by name.\n5. Maintains the highest standards in cleanliness and appearance of the showroom through\nstocking shelves, housekeeping, creating displays, etc.\nGeneral Results Responsibilities\n1. Maintains knowledge of new and existing products and inventory by participating in training,\nstudying Johnstone and industry catalogs and web sites, and seeking knowledge from\nexperienced staff members and factory representatives.\n2. Is organized and orderly, and capable of maintaining appropriate records.\n3. Completes all transactions and necessary paperwork accurately and in a timely manner.\n4. May represent Johnstone Supply at trade associations, events and local chapters.\nJohnstone Supply believes that each employee's contribution should not be limited by the assigned\nresponsibilities. Therefore, it is expected that each employee will offer his/her services wherever\nand whenever necessary to ensure the success of our endeavors.\nQualifications:\nTo perform this job successfully, an individual must be able to perform each essential job\nfunction satisfactorily. The requirements listed below are representative of the knowledge, skills,\nand/or abilities required. Reasonable accommodations may be made to enable individuals with\ndisabilities to perform the essential functions.\nEducation and Experience:\n⚫ Required: High School Diploma or G.E.D and minimum of two years related experience\nand/or training in material handling of durable goods including hazardous materials; OR\nequivalent combination of education and experience.\n⚫ Preferred: The above plus 2 years experience with a wholesale HVAC/R or similar\nindustry.\nJob-Specific Knowledge, Skills & Abilities\nAbility to provide consistent, professional customer service.\n⚫ Problem-solving skills: listening to, interpreting, and meeting the needs of others;\ndiagnosing and rectifying problems that will often require attention to detail.\n• Ability to maintain a positive, courteous, and friendly demeanor.\nJohnstone Supply of Central NY provides equal employment opportunities to all employees and applicants for employment and\nprohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status,\ngenetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal,\nstate or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion,\ntermination, layoff, recall, transfers, leaves of absence, compensation and training.\nJohnstone Supply of Central NY-Confidential\n2 of 4\nRev 190805\nWarehouse Delivery Driver.docx",
  "confidence": 0.946
}