{
  "image_name": "Vamp0000039559.png",
  "ocr_text": "NEW\nYORK\nSTATE\nDepartment of Taxation and Finance\nNew York State and Local Sales and Use Tax\nResale Certificate\nName of purchaser\nWallace Supply LLC\nStreet address\nST-120\n(6/18)\nName of seller\nStreet address\nCity\nState\nZIP code\nCity\nMark an X in the appropriate box:\nSingle-use certificate\nTemporary vendors must issue a single-use certificate.\n☑ Blanket certificate\nTo the purchaser:\nState\nZIP code\nYou may not use this certificate to purchase items or services that are not for resale. If you purchase tangible personal property or services\nfor resale, but use or consume the tangible personal property or services yourself in New York State, you must report and pay the unpaid tax\ndirectly to New York State. Any misuse of this certificate will result in tax liabilities and substantial penalty and interest.\nPurchaser information - please type or print\nI am engaged in the business of\nand principally sell.\n(Contractors may not use this certificate to purchase materials and supplies.)\nPart 1 - To be completed by registered New York State sales tax vendors\nI certify that I am:\na New York State vendor (including a hotel operator or a dues or admissions recipient), show vendor or entertainment vendor. My\nvalid Certificate of Authority number is\na New York State temporary vendor. My valid Certificate of Authority number is\nI am purchasing:\n☑A. Tangible personal property (other than motor fuel or diesel motor fuel)\nand expires on\n⚫ for resale in its present form or for resale as a physical component part of tangible personal property;\n⚫ for use in performing taxable services where the property will become a physical component part of the property upon which the\nservices will be performed, or the property will actually be transferred to the purchaser of the taxable service in conjunction with the\nperformance of the service; or\nB. A service for resale, including the servicing of tangible personal property held for sale.\nC. Restaurant-type food, heated food, or heated drink for resale.\nPart 2 - To be completed by non-New York State purchasers\nI certify that I am not registered nor am I required to be registered as a New York State sales tax vendor. I am registered to collect sales\ntax or value added tax (VAT) in the following state/jurisdiction\nand have\nbeen issued the following registration number\n(If sales tax or VAT registration is not\nrequired and a registration number is not issued by your home jurisdiction, indicate the location of your business and write not applicable on\nthe line requesting the registration number.)\nI am purchasing:\nD. Tangible personal property (other than motor fuel or diesel motor fuel) for resale, and it is being delivered directly by the seller to my\ncustomer or to an unaffiliated fulfillment services provider in New York State.\nE. Tangible personal property for resale that will be resold from a business located outside New York State.\nCertification: I certify that the above statements are true, complete, and correct, and that no material information has been omitted. I make these\nstatements and issue this exemption certificate with the knowledge that this document provides evidence that state and local sales or use taxes",
  "confidence": 0.981
}