{
  "image_name": "Vamp0000012454.png",
  "ocr_text": "Job Description- Warehouse Delivery Driver- continued\nGeneral knowledge in the safe handling of durable goods including hazardous materials.\n⚫ Skill in the safe use of material handling equipment\n• Skill in proactively communicating (both verbal and written) to establish mutual respect\nand understanding.\n⚫ Math skills, including ability to: add, subtract, multiply, divide; and calculate margins,\ndiscounts and percentages.\n⚫ Skill in using point-of-sale computer systems to locate information and process\n⚫\ntransactions.\nSkill in using web-based tools to research product and information.\n• Ability to work productively in teams with a wide range of people.\nAbility to work independently with minimal direction.\n• Ability to follow written instructions and documented procedures.\nExpected Work Behaviors:\nKeeps the company's best interest in mind when considering or addressing issues.\n• Dedication to attending work and work-related functions prepared and on time.\n• Maintains a professional personal appearance.\n• Strives for continuous self-improvement and for improvement of the business with\nrespect to safety, safe handling of materials, and service quality.\nPhysical Demands & Work Environment:\nThe physical demands and work environment characteristics described here are representative\nof those an employee encounters while performing the essential functions of this job.\nReasonable accommodations may be made to enable individuals with disabilities to perform the\nessential functions.\nPhysical: While performing the duties of this job, the employee is required to either stand and\nwalk on a hard surface or drive a delivery vehicle and load or unload the truck for the majority of\nthe workday. The employee is regularly required to reach with hands and arms, climb and\nbalance; stoop, kneel, crouch, or crawl. The employee is frequently required to lift and carry\nand/or move up to 50 pounds, and occasionally required to lift up to 70 pounds. Specific vision\nabilities required by this job include close vision, color vision, depth perception, and ability to\nadjust focus. The ability to speak and hear sufficiently to provide customer service is required.\nStore Environment: Medium to large store with shelves and bins, most work is performed with\ntelephone, material handling equipment, computer, fax, printer, and in some cases an RF\nscanner.\nSkills Summary:\nSafe Driving Skills\nEnergetic\nTime Management\nOral Communications Skills\nAbility to lift up to 70 pounds\nMath Aptitude\nJohnstone Supply of Central NY provides equal employment opportunities to all employees and applicants for employment and\nprohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status,\ngenetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal,\nstate or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion,\ntermination, layoff, recall, transfers, leaves of absence, compensation and training.\nJohnstone Supply of Central NY-Confidential\n3 of 4\nRev 190805\nWarehouse Delivery Driver.docx",
  "confidence": 0.924
}