{
  "image_name": "Vamp0000049973.png",
  "ocr_text": "AUTHORIZATION TO EXCELLUS HEALTH PLAN, INC. (“HEALTH PLAN”)\nTO DISCLOSE PROTECTED HEALTH INFORMATION (PHI)\nCheck here only if you are authorizing access to psychotherapy notes. If checked, this form cannot be used for any\nother purpose. You must complete a separate form for authorizing access to any other information. If this box is checked,\nskip Part D.\nPLEASE PRINT\nPART A: MEMBER INFORMATION TO BE DISCLOSED\nLAST NAME\nFIRST NAME\nFIR Durrell\n\"Sterling\nD8557 Shagbark Way\nCURRENT ADDRESS\nMI\nDATE OF BIRTH\nIDENTIFICATION # - located on ID card(s)\nG\nCITY\n06/08/1965\nFairport\nSTATE/ZIP CODE\nPART B: HEALTH PLAN CAN SHARE MY INFORMATION WITH THE FOLLOWING PERSON(S)\nNAME OF PERSON/ORGANIZATION\nAN\nNN\n\"Maynard\nNAME OF PERSON/ORGANIZATION\nADDRESS\nADDRESS\nNY/14450\n$95 Halstend st Rochester NY\nPART C: REASON FOR DISCLOSURE\n☑Any information requested (including anything checked in the specified conditions in Part D below)\n☐ At the request of the individual\n☐ Other:\nIf you would like to limit the disclosure of information to a specific provider, condition or date(s), please specify below:\nLimit information to:\n_and/or date range\nMM/DD/YYYY\nPART D: HEALTH PLAN CAN SHARE THE FOLLOWING INFORMATION (check all that apply)\nNOTE: Skip this section if psychotherapy was checked at the top of this form\nto\nMM/DD/YYYY\nEnrollment (e.g. eligibility, address, dependents, birth date)\n☑ Claim (e.g. status, provider, dates, payment, diagnosis)\n✓ Benefit (e.g. benefit coverage, usage, limits)\n☐ Clinical records (e.g. doctor/facility, case management)\nI choose to include information regarding the following conditions (check all that apply):\n☐ Genetic testing\n☐ Sexually transmitted diseases\n☐ Alcohol or substance abuse ☐ Mental health (excluding psychotherapy\n☐ Abortion\nnotes)\nNote: you must complete a separate form to authorize release of information related to HIV/AIDS. The NYS approved form can be found\nat http://www.health.ny.gov/diseases/aids/providers/forms/informed consent.htm\nPART E: ACKNOWLEDGEMENT (PLEASE READ AND SIGN)\nI understand that:\n⚫ I can revoke this authorization at any time by writing to the Health Plan at the address listed below except this revocation would not\naffect any action taken by the Health Plan in reliance on this authorization before my written revocation is received.\n•Information disclosed as a result of this authorization may be re-disclosed by the recipient. Federal and state privacy laws may no\nlonger protect my PHI.\nHealth Plan will not condition my enrollment in a health plan, eligibility for benefits or payment of claims on my giving this\nauthorization.\nIMPORTANT: I have read and understand the terms of this authorization. I hereby authorize the use and disclosure of my protected\nhealth information in the manner described in this form. Unless you receive revocation in writing, this authorization will be valid\nuntil Health Plan completes activities gutlined in Part C or until the date specified here: 1/31/2019\nSignature:\nBel\nDate:\n9/17/19\nIf this request is from a personal representative on behalf of the member, complete the following:\nPersonal Representative's Name:\nPersonal Representative Signature\nDescription of Authority: ☐ Parent ☐ Legal Guardian* ☐ Power of Attorney* ☐ Other *\nB-1565\n* You must provide documentation supporting your legal authority to act on behalf of the member\nINCOMPLETE FORMS WILL NOT BE PROCESSED – BE SURE TO RETAIN A COPY FOR YOUR RECORDS\nReturn form to:\n-\nExcellus Health Plan, Inc.\nPO Box 22999, Rochester, NY 14692\nor Fax: 1-315-671-7079\nMar-16",
  "confidence": 0.929
}