{
  "image_name": "Vamp0000036391.jpg",
  "ocr_text": "Steven Brace\nSeptember 6, 2022\nBranch locations:\n2609 Dearborn St\nEaston, PA 18045\n610-258-5651\n610-258-9332 fax\n2300 N 5th St Hwy\nReading, PA 19603\n610-373-3665\n610-373-1091 fax\n2221 Sycamore St\nHarrisburg, PA 17111\n717-233-7593\n717-233-6123 fax\n340 W Roseville Rd\nLancaster, PA 17603\n717-286-0301\n717-286-0302 fax\n9100 Yellow Brick Rd\nRosedale, MD 21237\n410-391-5495\n410-391-5496 fax\n1660 Sulphur Spring Rd\nArbutus, MD 21227\n410-568-7390\n410-568-7391 fax\n6584 Fleet Drive\nAlexandria, VA 22310\n703-719-7770\n703-719-7773 fax\nDear Steven:\nWe are pleased to offer you the branch manager position working in our Rosedale,\nMD branch. Your anticipated start date will be September, 2022 provided your\nbackground checks are complete, but please be advised that our offer of employment\nis contingent upon the results of your pre-employment drug test and background\nchecks.\nIn this position your bi-weekly, base salary will be $ 3,076.92, which calculates to\n$ 80,000.00 annually. In addition you will be eligible for a quarterly branch\nmanager bonus based upon the financial results of the branch. A copy of an example\ncan be sent to you for your review. We will guarantee an annual bonus of $22,000\nfor the first year of employment. We will pay and guarantee this bonus in the\namount of $ 5,500 per quarter. Semi-annual branch manager scorecard bonus will\nbe paid - total amount that can be earned is $5,000 annually.\nAll new employees work on an introductory basis for the first 90 calendar days. The\nintroductory period is intended to give new employees the opportunity to\ndemonstrate their ability to achieve a satisfactory level of performance and to\ndetermine whether the new position meets their expectations.\nDuring the introductory period, you are eligible for those benefits that are required\nby law, such as Workers' Compensation Insurance and Social Security.\nOther benefits include:\n•\n•\nYou will be eligible for 5 days of PTO in 2022 and 15 days each year\nthereafter until our policy exceeds that number of eligible days.\nEffective 10/1/2022 eligible to participate in the company's Health and\nDental benefit plans\nEligible for Life Insurance benefit after 90 days of employment\nParticipation in the 401K plan will be according to the guidelines laid out in\nthe plan.\nYou will be provided a company cell phone and other items you need to\nperform your job.\nMonthly auto allowance of $ 400 per month.\nThe above benefits are based on a September, 2022 start date.\nWe look forward to having you join Johnstone Supply.\nSincerely,\nJeff Green\n8680 Virginia Meadows Dr\nManassas, VA 20109\n703-530-8990\n703-530-8994 fax\n(Steven Brace) Please sign to acknowledge receipt of offer",
  "confidence": 0.942
}