{
  "image_name": "Vamp0000023667.jpeg",
  "ocr_text": "ADP\nTERMINATION FORM\nSTEP 1 | PARTICIPANT INFORMATION (Please print and complete this section in full)\n315-486-6151\nPhone\nHarris\nEmployee Name (Last)\n107 Kofira Ln\nAddress (Street)\nGreene\nCity\n132426688\nSocial Security #\nDavid\nFirst\nApt # /P.O. Box\nState\nNew York\nParticipant must be provided with the Special Tax Notice Regarding Plan Payments.\nJ\nMiddle Initial\n13778\nZip Code\nSTEP 2 REASON FOR DISTRIBUTION (Please check one box only and enter data)\nEmployment Termination or Resignation\nRetirement\nDisability\nPlan Termination by Employer\nTermination Date:\n(MM/DD/YYYY)\nSTEP 3 | FUNDS DISBURSEMENT ELECTION (Select A, B or C; if a rollover is selected, also complete Step 4)\nA.Total Distribution: (select one of the following)\nOR\nB.\nOR\nPay me 100% of my account balance in a cash distribution\nRollover 100% of my account balance (complete Step 4)\nRollover $\nand pay the remainder to me in cash distribution\n(complete Step 4) (taxable amounts will be rolled over before any non-taxable amounts)\nRollover all of my pre-tax amounts and pay me any nontaxable amounts in a cash distribution (complete Step 4)\nPartial Distribution: Distribute a portion of my vested account balance and leave the remaining balance in the Plan.\n(A Partial Distribution is not available if the Plan Sponsor is terminating the Plan.) Specify the dollar amount to be distributed\nwhich is less than 100% of your account balance in the Plan, a payment option, and select a money type/source (if desired):\nPartial Distribution Amount: $_\nPayment Option: (select one)\nPay me 100% of the Partial Distribution Amount in a cash distribution (select money type below if desired)\nRollover 100% of the Partial Distribution Amount (complete Step 4) (select money type below if desired)\nRollover $\nand pay the remainder to me in cash distribution, up to the Partial Distribution Amount\n(complete Step 4) (taxable amounts will be rolled over before any non-taxable amounts) (do not select money type below)\nMoney Type Election: Your Partial Distribution (both Rollover and cash) will be withdrawn proportionally from all of your money\ntypes unless you limit the Partial Distribution to the following money type(s) by checking one or more boxes below:\nPre-tax Rollover (Pre-tax Rollover money and earnings)\nAfter-tax (non-Roth after-tax money and earnings)\nNote: If the type of money selected is not sufficient to cover distribution amount, then the amount processed will be reduced to\nthe maximum amount available for that money type(s).\n99-3792-1219\n206\nForm continued →\nPage 2 of 3",
  "confidence": 0.967
}