{
  "image_name": "Vamp0000034141.jpg",
  "ocr_text": "JOHNSTONE\nSUPPLY\nThe Wallace Group\nAugust 5, 2022\nJames Loughry\nBealeton, VA/ 22712\nDear James,\nOn behalf of Johnstone Supply Wallace Group, I am pleased to offer you a position as a full-time\nHVAC/R Counter Sales Representative at our Gainesville, VA location.\nThe hourly rate for this position will be $20.00. In addition, you will be eligible for the Gain Sharing\nBonus Program, which is paid monthly. Calculation details of the program will be discussed upon your\nacceptance of this offer.\nYou will report to Seon Fernandes (703) 530-8990 ext. 850 (sfernandes@jswallacegroup.com). Jaime\nRotz is the Regional Operations Manager.\nAll new employees work on an introductory basis for the first 90 calendar days. The introductory period\nis intended to give new employees the opportunity to demonstrate their ability to achieve a satisfactory\nlevel of performance and to determine whether the new position meets their expectations. During the\nintroductory period, you are eligible for any benefits that are required by law, such as Workers'\nCompensation Insurance and Social Security.\nOther benefits include:\nEligible for 2 days (16 hours) of PTO in 2022, which is available for use upon\ncompletion of the 90-day introductory period.\n• Eligible for 10 days (80 hours) of PTO in 2022, which is available for use upon\ncompletion of your one-year anniversary.\n• Eligible for company Medical, Dental and Vision Plans on the first of the\nmonth following your hire date.\n•\nCompany-paid Life Insurance after 90 days of employment\n• Participation in 401K according to the guidelines laid out in the plan\nBenefits listed above are based on an August 2022 start date. Please digitally sign and date this letter and\nreturn it to me to indicate your acceptance of this offer. Your start date will be determined at the\ncompletion of our pre-employment screening evaluations.\nWe look forward to welcoming you as a new employee at Johnstone Supply Wallace Group.\nSincerely,\nBill Henry 610-762-3794\nHR Department\nJohnstone Supply - The Wallace Group\nEaston, PA\nJames Derek Loughry August 5, 2022\nJames Torby Aug. 9, 2022\nDuch\nSignature Date (Please type your name and today's date above)",
  "confidence": 0.954
}