{
  "image_name": "Vamp0000012706.png",
  "ocr_text": "JOHNSTONE SUPPLY\nJOHNSTONE\nRochester: 95 Halstead Straat, 14610\nToll Free: (800) 724-8806\nTet (680) 482-8000 • Fax: (585) 482-6000\neMail: store141johnstonesupply.com\nMarch 2, 2020\nMr. Fernando Santiago\n33 Engel Place\nSyracuse: 835 Canal Street, 13210\nToll Free: 1877; 724-8806\nTel: (316) 479-8900 Fax: (315) 479-8600\neMail: store269johnstonesupply.com\nOrder on-line at www.JohnstoneSupply.com/141\nRochester, NY 14620\nDear Fernando:\nI am pleased to offer you the position of Warehouse Delivery Driver for Johnstone Supply of Central\nNY. This letter is to confirm my offer and your acceptance of the position. You will be reporting\ndirectly to Stephen Short as your Branch Manager. Your tentative start date is scheduled for March\n16, 2020.\nThis is a full-time, nonexempt position eligible for overtime pay after 40 hours worked in a workweek.\nWe are offering you a starting base wage of $14.00 per hour paid biweekly, according to Johnstone\nSupply of Central NY's payroll practices.\nUpon the successful completion of your 90-day probationary period you will become eligible for\nseveral employment benefits as outlined on the accompanying Benefits Overview.\nThis job offer is contingent upon the following:\nSatisfactory reference checks.\nCompletion of a satisfactory background check.\nMotor vehicle check/MVR.\nOn your first day, you will be given an orientation by Human Resources. This orientation will include\ncompleting employment forms, reviewing benefits, introduction to management and touring the\npremises. Please bring appropriate documentation for the completion of your new-hire forms,\nincluding proof that you are presently eligible to work in the United States for 1-9 Form purposes.\nFailure to provide appropriate documentation within three days of hire will result in immediate\ntermination of employment in accordance with the terms of the Immigration Reform and Control Act.\nPlease indicate your acceptance of our offer by signing below and returning one copy of the letter,\nwith your original signature, to me no later than Monday, March 9, 2020. We would appreciate having\nyour decision as soon as possible, but please feel free to talk to me further if you have any questions.\nFernando, I am confident that you have the skills, enthusiasm, and talent to be successful in this\nchallenging position. I look forward to having you on my team.\nWelcome to JOHNSTONE SUPPLY!\nSincerely,\n-1-",
  "confidence": 0.936
}