{
  "image_name": "Vamp0000012470.png",
  "ocr_text": "RBA\nSTAFFING\na division of\nGREATER\nROCHESTER\nChamber of Commerce\nBACKGROUND & REFERENCE CHECKING AUTHORIZATION\nAll information provided by me as part of my application for employment is accurate and true to the best of my\nknowledge. I understand and agree that any misrepresentation or omission of information by me may result in my\nrejection from employment or, if hired, in my discharge.\nI understand and agree that as part of its evaluation of my suitability for employment, Johnstone Supply of CNY should\nreceive consumer reports and/or investigative consumer reports, which will contain information and opinions pertaining\nto my educational background, previous work experience and work-related qualifications, behavior and character.\nI acknowledge that I have received and read the Fair Credit Reporting Act Background Check Disclosure, A Summary\nof Your Rights Under the Fair Credit Reporting Act, as well as Article 23-A of the New York Corrections Law, and this\nauthorization. I certify that I understand the documents I have received. I further understand that I have the right to\nrequest information from Johnstone Supply of CNY about the nature and scope of any investigative consumer report on\nme that is requested by Johnstone Supply of CNY, provided the request is made in writing and within a reasonable period\nof time after I have received this disclosure.\nI therefore, knowingly and voluntarily, authorize law enforcement agencies, public and private schools, federal, state\nand local agencies and courts, information bureaus, current and former employers, financial institutions, licensing\nagencies, governmental agencies, the military, and other individuals and entities to provide any and all information that\nis requested by RBA. I further specifically consent to the disclosure of information and opinions concerning me\ncontained in files of the educational institutions I have attended or am currently attending, and personnel files of my\ncurrent and former employers and provided by other individuals and entities, including personal and professional\nreferences, to RBA Staffing (RBA) acting on behalf of Johnstone Supply of CNY.\nI also consent specifically to the release of any information and opinions by my current and former educators and\nemployers about my education or work by their agents and employees to RBA acting on behalf of Johnstone Supply of\nCNY. I also authorize RBA to access financial and credit records available through credit agencies or bureaus, criminal\nbackground inquiries, public records and public record databases, and driving records. I also authorize and consent to\nthe disclosure by RBA to Johnstone Supply of CNY of any information and opinions it obtains about me. I understand\nthat if I would like additional information about the investigation that may be done by RBA, I should contact RBA in\nwriting at, 150 State St. Suite 400, Rochester, New York 14614.\nThis authorization, in original or copy, shall be valid for this and any future reports and updates that may be\nrequested. These consumer reports and/or investigative consumer reports may be obtained at any time after the receipt\nof my authorization and, if I am hired by Johnstone Supply of CNY, and throughout my employment. I intend that a\ncopy of this Authorization be as valid as the original.\nI certify that the information provided on this form is true and correct. I understand that any information that I\nprovide in an employment application or that I otherwise disclose during my employment may be used to obtain\nconsumer reports and/or investigative consumer reports. I also understand that the information I provide regarding my\ndate of birth will be used for the sole purpose of accurately gathering the above mentioned information, and will not be\nused to discriminate against me in violation of any state or federal law. RBA and Johnstone Supply of CNY will retain\nthis form as required by law, in a secure location to ensure confidentiality.",
  "confidence": 0.984
}