{
  "image_name": "Vamp0000036924.png",
  "ocr_text": "ARE YOU A GOOD FIT?\nWe are looking for someone who is eager to get on the road with a great company.\nAsk yourself: Are you looking for a job where you can work independently? Do you\npay attention to safety at all times? Are you someone who loves to drive? Do you take\npride in being an organized and reliable individual? If so, please consider applying\nfor this Equipment Delivery Services Team Member (Driver) job today!\nWHAT WE NEED FROM YOU\nAs an Equipment Delivery Services Team Member and driver, you responsibly\ntransport clients' valued items in a timely manner along your designated route. You\nare a positive representative of Johnstone Supply as you receive UPS or miscellaneous\norders and complete timely deliveries. And, you are a competent and dependable\ndriver who navigates the roads with the utmost concern to those around you.\nEnsuring that every customer experience is a positive one, you remember to check in\nwith clients and even assist them with 'will call' pickups. As you load or unload the\ncompany-provided work van, you are respectful of the items our customers have\nordered.\nYou also operate a forklift, hand truck, manual pallet jack, and other equipment, truly\ntaking the safety of others and yourself seriously. You ensure that the warehouse is\nkept clean and safety codes are followed. At the end of the day, after meticulously\nkeeping all necessary paperwork up-to-date, you feel accomplished and satisfied that\nyou provided timely, courteous deliveries for our customers. If you can do this and\nmeet the following requirements, we would be excited to have you join us!\n⚫ A high school diploma or the equivalent\n• A valid driver's license\n• A clean driving record\n• Can pass a pre-hire drug test, background check, and a DOT medical exam\n• Have basic computer and map-reading skills\n•\n•\nPossess a valid DOT Medical certification card\nPhysically capable of completing job-related tasks including maneuvering up to\n75 lbs\n. Any prior truck driving/forklift experience is preferred!\nLocation: 18045",
  "confidence": 0.913
}