{
  "image_name": "Vamp0000038516.jpg",
  "ocr_text": "Virginia\nSpine\nSpecialists\nMinimally Invasive Spine Care\nMudit Sharma, MD, FAANS, FACS\nBoard Certified Neurosurgeon\nName:\nWork Restrictions\nRichard Malloch\nNature of Injury:\nDOB:\n12/8159\n☑\nWork related injury\nOther\n☑\nPatient is able to return to work without restrictions as of\nPatient is able to return to work with restrictions marked below\nfrom\nto\nPatient is unable to return to work from 11/29/22 to next appointment in bweeks,\nWork restrictions according to the U.S. Department of Labor:\nSedentary Work. Sedentary Work involves exerting up to 10 pounds of force occasionally or a\nnegligible amount of force frequently to lift, carry, push, pull, or otherwise move objects, including the\nhuman body. Sedentary work involves sitting most of the time but may involve walking or standing for\nbrief periods of time. Jobs may be defined as Sedentary when walking and standing are required only\noccasionally, and all other Sedentary criteria are met.\nLight Work. Light Work involves exerting up to 20 pounds of force occasionally or up to 10 pounds of\nforce frequently, or a negligible amount of force constantly to move objects. Physical demand\nrequirements are in excess of those for Sedentary Work. Even though the weight lifted may be only a\nnegligible amount, a job/occupation is rated Light Work when it requires: (1) walking or standing to a\nsignificant degree; (2) sitting most of the time while pushing or pulling arm or leg controls; or (3)\nworking at a production rate pace while constantly pushing or pulling materials even though the weight\nof the materials is negligible. (The constant stress and strain of maintaining a production rate pace,\nespecially in an industrial setting, can be and is physically demanding of a worker even though the\namount of force exerted is negligible.)\nMedium Work. Medium Work involves exerting 20 to 50 pounds of force occasionally or 10 to 25\npounds of force frequently or an amount greater than negligible and up to 10 pounds constantly to\nmove objects. Physical demand requirements are in excess of these for Light Work.\nHeavy Work. Heavy Work involves exerting 50 to 100 pounds of force occasionally, or 25 to 50\npounds of force frequently, or 10 to 20 pounds of force constantly to move objects. Physical demand\nrequirements are in excess of those for Medium Work.\nVery Heavy Work. Very Heavy work involves exerting in excess of 100 pounds of force occasionally,\nor in excess of 50 pounds of force frequently or in excess of 20 pounds of force constantly to move\nobjects, Physical demand requirements are in excess of those for Heavy Work.\nOther:\nPatient requires a follow up appointment on\nSignature :\nat\nAM/PM with: Dr. Mudit Sharma\n□ David Pope, PA-C\nChapt PA-C Date:\nAuf Chap\n4\n□ Jennifer Chapot, PA-C\n11/9122\nVirginia Spine Specialists PLLC\nManassas: 8650 Sudley Road, Ste 315 | Manassas, VA 20110\nFredericksburg: 4604 Spotsylvania Parkway, Ste 300 | Fredericksburg, VA 22408\nPhone: 571-921-4877 | Fax: 571-208-0585",
  "confidence": 0.938
}